{"extracted_information": "Electron applications, unlike traditional web browsers, have elevated privileges (e.g., filesystem access, user shell), which increases inherent security risks. Displaying arbitrary content from untrusted sources is not recommended. Security is a shared responsibility, encompassing the Electron framework (Chromium, Node.js), NPM dependencies, and application code. It is crucial to evaluate dependencies, adopt secure coding practices, and isolate untrusted content to prevent security issues like Cross-Site Scripting (XSS) from escalating to Remote Code Execution (RCE).", "specifications": {}, "pricing": {}, "features": [{"title": "Only load secure content", "description": "Load any resources not included with your application using secure protocols like HTTPS, WSS, FTPS, instead of insecure HTTP, WS, FTP.", "why": "Ensures data integrity (data not modified in transit) and encrypts traffic between application and host.", "how": "Use `browserWindow.loadURL('https://example.com')` instead of `http://example.com`."}, {"title": "Do not enable Node.js integration for remote content", "description": "It is paramount that you do not enable Node.js integration in any renderer (BrowserWindow, WebContentsView, or webview) that loads remote content.", "why": "Prevents cross-site-scripting (XSS) attacks from escalating into 'Remote Code Execution' (RCE) attacks by limiting attacker's ability to execute native code.", "how": "Ensure `webPreferences` do not explicitly enable `nodeIntegration: true` or `nodeIntegrationInWorker: true`. Use preload scripts with `contextBridge API` to selectively expose Node.js-based APIs to remotely loaded content."}, {"title": "Enable Context Isolation", "description": "Run code in preload scripts and Electron APIs in a dedicated JavaScript context, preventing modification of global objects by renderer process scripts.", "why": "Even with `nodeIntegration: false`, context isolation enforces strong isolation and prevents the use of Node primitives from the renderer process."}, {"title": "Enable process sandboxing", "description": "Use Chromium's sandboxing feature to significantly limit what renderer processes have access to.", "why": "Loading, reading or processing any untrusted content in an unsandboxed process, including the main process, is not advised."}, {"title": "Handle session permission requests from remote content", "description": "Implement a custom handler for session permission requests (e.g., notifications) from remote content instead of relying on Electron's default auto-approval.", "why": "By default, Electron automatically approves all permission requests. Security-conscious developers should assume the opposite and manually approve based on verification.", "how": "Use `session.fromPartition('some-partition').setPermissionRequestHandler((webContents, permission, callback) => { /* Verify URL and permission, then callback(true/false) */ })`. Always verify the URL."}, {"title": "Do not disable webSecurity", "description": "Do not set the `webSecurity` property to `false` on a renderer process (BrowserWindow, WebContentsView, or webview) in production applications.", "why": "Disabling `webSecurity` disables the same-origin policy and implicitly sets `allowRunningInsecureContent` to `true`, allowing execution of insecure code from different domains."}, {"title": "Define a Content Security Policy (CSP)", "description": "Implement a Content Security Policy to restrict and control the resources Electron can load for a given web page.", "why": "Provides an additional layer of protection against cross-site-scripting and data injection attacks by defining allowed script, style, and other resource sources.", "how": "Use a restrictive CSP like `Content-Security-Policy: script-src 'self' https://apis.example.com`. Can be set via `webRequest.onHeadersReceived` in the main process or via a `<meta>` tag in the HTML for `file://` protocols."}, {"title": "Do not enable allowRunningInsecureContent", "description": "Do not set the `allowRunningInsecureContent` property to `true` in `webPreferences`.", "why": "Electron by default prevents websites loaded over HTTPS from loading and executing scripts, CSS, or plugins from insecure HTTP sources ('mixed content'). Enabling this property disables that protection, compromising authenticity and integrity."}, {"title": "Do not enable experimental features", "description": "Avoid enabling experimental Chromium features using the `experimentalFeatures` property.", "why": "Experimental features are not fully tested, and their security implications for Electron applications may be unknown. Only enable if you fully understand the risks and have a legitimate use case."}, {"title": "Do not use enableBlinkFeatures", "description": "Avoid using the `enableBlinkFeatures` property to enable disabled Blink rendering engine features.", "why": "Features are often disabled by default for good reasons, potentially including security implications. Only enable if you fully understand why and the ramifications on security."}, {"title": "Do not use allowpopups for WebViews", "description": "If `webview` tags do not require creating new windows via `window.open()`, do not use the `allowpopups` attribute.", "why": "Adheres to the principle of minimally required access, preventing the creation of new `BrowserWindows` unless explicitly needed, thereby reducing potential attack surface."}, {"title": "Verify WebView options before creation", "description": "Control the creation of new `webview` tags from the main process and verify their `webPreferences` do not disable security features.", "why": "Scripts in the renderer process can create `webview` tags, potentially with insecure options. This allows prevention of `webview` creation with disabled security features.", "how": "Use `app.on('web-contents-created', (event, contents) => { contents.on('will-attach-webview', (event, webPreferences, params) => { /* Strip preload, disable nodeIntegration, verify src, then preventDefault() if insecure */ }) })`."}, {"title": "Disable or limit navigation", "description": "If your application only needs to navigate to known pages, limit navigation to that specific scope and disallow all other types of navigation.", "why": "Navigation is a common attack vector. An attacker could convince your app to navigate to untrusted web sites, making exploitation easier even if other security measures are in place.", "how": "In a `will-navigate` handler, call `event.preventDefault()` if the `navigationUrl` does not match an allowed URL. Always use Node's `URL` parser for robust URL comparison (e.g., `parsedUrl.origin !== 'https://example.com'`)."}, {"title": "Disable or limit creation of new windows", "description": "If your application has a fixed set of windows, limit the creation of additional windows.", "why": "Creation of new `webContents` is an attack vector, where attackers try to create new windows with elevated privileges or open pages that couldn't be opened before.", "how": "Register a handler for `contents.setWindowOpenHandler()` and deny any unexpected window creation (e.g., `return { action: 'deny' }`), optionally opening trusted external URLs with `shell.openExternal`."}, {"title": "Do not use shell.openExternal with untrusted content", "description": "Do not use the `shell.openExternal` API with untrusted or user-controlled content.", "why": "Improper use of `openExternal` can lead to arbitrary command execution on the user's host, compromising the system.", "how": "Only use `shell.openExternal` with explicitly trusted, hardcoded URLs or after strict validation."}, {"title": "Use a current version of Electron", "description": "Always strive to use the latest available version of Electron and update your application quickly when new major versions are released.", "why": "Older Electron, Chromium, and Node.js versions are easier targets as their security issues and exploits are more widely known and available. Latest versions include patches for critical vulnerabilities.", "how": "Migrate your app one major version at a time, referring to Electron's Breaking Changes documentation."}, {"title": "Validate sender of all IPC messages", "description": "Always validate the `sender` property of incoming IPC messages in the main process.", "why": "All web frames (including iframes and child windows) can send IPC messages. Without validation, untrusted renderers could trigger privileged actions or access sensitive user data.", "how": "Implement a validation function for `e.senderFrame` that checks the `frame.url.host` against an allowlist for all IPC handlers (e.g., `ipcMain.handle('get-secrets', (e) => { if (!validateSender(e.senderFrame)) return null; return getSecrets(); })`)."}, {"title": "Avoid usage of the file:// protocol and prefer usage of custom protocols", "description": "Serve local pages using a custom protocol instead of the `file://` protocol.", "why": "The `file://` protocol has more privileges in Electron and browsers, allowing XSS issues to load arbitrary files from the user's machine. Custom protocols offer more control and align better with web URL behavior, limiting file access.", "how": "Follow `protocol.handle` examples to serve files or content from a custom protocol."}, {"title": "Check which fuses you can change", "description": "Understand and configure Electron's 'fuses' to disable unnecessary features that could be exploited.", "why": "Fuses like `runAsNode` and `nodeCliInspect` can allow external scripts to execute commands on the device with the application's permissions, potentially leading to privilege escalation.", "how": "Use the `@electron/fuses` module to manage fuses, referring to its README and Electron's documentation on how to flip fuses."}, {"title": "Do not expose Electron APIs to untrusted web content", "description": "Avoid directly exposing raw Electron APIs (especially IPC methods like `ipcRenderer.on`) to untrusted web content in your preload scripts.", "why": "Exposing raw APIs gives renderer processes direct access to the entire IPC event system, allowing them to listen for any IPC events or access underlying `ipcRenderer` instances, which is dangerous.", "how": "Use `contextBridge.exposeInMainWorld()` to expose only specific, safe, and tightly controlled wrappers around Electron APIs. For example, `contextBridge.exposeInMainWorld('electronAPI', { onUpdateCounter: (callback) => ipcRenderer.on('update-counter', (_event, value) => callback(value)) })`."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [{"name": "Electronegativity", "url": "https://github.com/doyensec/electronegativity", "description": "Tool to automate the detection of misconfigurations and insecure patterns in Electron applications."}, {"name": "Guide for developers and auditors on Electron security", "url": "https://doyensec.com/resources/us-17-Carettoni-Electronegativity-A-Study-Of-Electron-Security-wp.pdf", "description": "Additional details on potential weaknesses and implementation bugs when developing applications using Electron."}]}