{"extracted_information": "The Tauri framework emphasizes security through its core design and ecosystem, aiming to make applications and users more secure by default. Key security features include clear trust boundaries between the application's Rust core and the frontend WebView, capability-based access control, and reliance on the operating system's WebView for improved security patching.", "specifications": {}, "pricing": {}, "features": [{"name": "Trust Boundaries and Isolation (Sandboxing)", "description": "Tauri's security model differentiates between Rust code (application core) and frontend code (WebView). Rust code has full access to system resources. Code executed in the WebView has restricted access, only to exposed system resources via a well-defined Inter-Process Communication (IPC) layer. This prevents trust boundary violations and limits privilege escalation for attackers.", "details": "The IPC layer acts as the bridge for communication, ensuring boundaries are not broken. Any code executed by plugins or the application core is not constrained, while WebView code is restricted."}, {"name": "Capability-Based Security", "description": "Access to core application commands from the frontend is configured and restricted by capabilities defined in the application's configuration. Individual command implementations can enforce optional fine-grained access levels, also defined within the capabilities configuration.", "details": "This provides granular control over what the frontend can access or execute within the native core."}, {"name": "External WebView Reliance (Security Patching)", "description": "Tauri relies on the operating system's WebView rather than bundling it within the application binary. This design choice significantly reduces known vulnerabilities as OS and WebView packet maintainers are, on average, significantly faster at patching and rolling out security updates compared to application developers who bundle WebViews directly.", "details": "This approach aims to reduce the average time it takes for security patches to reach the end-user."}], "statistics": {"security_patch_rollout_speed": "WebView packet maintainers and operating system packet maintainers are, on average, significantly faster to patch and roll out security-patched WebView releases than application developers who bundle the WebView directly with their application."}, "temporal_info": {"copyright_year": "2025"}, "geographical_data": {}, "references": [{"type": "concept", "name": "IPC layer", "url": "/concept/inter-process-communication/"}, {"type": "vulnerability_disclosure", "name": "Github Vulnerability Disclosure", "url": "https://docs.github.com/en/code-security/security-advisories/guidance-on-reporting-and-writing-information-about-vulnerabilities/privately-reporting-a-security-vulnerability#privately-reporting-a-security-vulnerability"}, {"type": "vulnerability_disclosure", "name": "Tauri repository security advisories", "url": "https://github.com/tauri-apps/tauri/security/advisories/new"}, {"type": "email_contact", "name": "security@tauri.app"}]}